app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    task_id = params[:id].to_i
    @task = Task.find_by(id: task_id)

INSERT INTO "tasks" ("action", "description", "created_at", "updated_at", "completion_date", "status_completed") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    filtered_task_params = task_params
    @task = Task.new(task_params)

    @task.status_completed = false

    is_successful = @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
  def edit
    @task = Task.find_by(id: (params[:id]))

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "fruits "], ["updated_at", "2018-09-21 22:18:50.739429"], ["id", 1]]
---
  def update
    @task = Task.find_by(id: (params[:id]))

    @task.update(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 13]]
---
    task = Task.find_by(id: params[:id])
    task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "tasks" SET "status_completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status_completed", true], ["updated_at", "2018-09-24 01:26:08.226181"], ["id", 15]]
UPDATE "tasks" SET "updated_at" = $1, "task_marked_completion_date" = $2 WHERE "tasks"."id" = $3  [["updated_at", "2018-09-24 01:48:30.529125"], ["task_marked_completion_date", "2018-09-23"], ["id", 16]]
UPDATE "tasks" SET "status_completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status_completed", false], ["updated_at", "2018-09-24 01:47:33.196504"], ["id", 15]]
UPDATE "tasks" SET "updated_at" = $1, "task_marked_completion_date" = $2 WHERE "tasks"."id" = $3  [["updated_at", "2018-09-24 01:48:32.139115"], ["task_marked_completion_date", nil], ["id", 16]]
---
  def complete
    @task = Task.find(params[:id])

    if @task.status_completed == false
      @task.update(status_completed: true)
      @task.update(task_marked_completion_date: Date.today)
    elsif @task.status_completed == true
      @task.update(status_completed: false)
      @task.update(task_marked_completion_date: nil)